billing_cf/InformationRegisters/энргДатыОтчетногоПериодыОбщиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДатыОтчетногоПериодыОбщиеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Завершение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/энргДатыОтчетногоПериодыОбщиеНастройки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область РеализацияИнтерфейса_

Функция ЗавершениеПериодаНачисленияПоОрганизации(Организация, Район) Экспорт  
	
	//Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
	//	ИмяМетода 					= "энргДатыОтчетногоПериодыОбщиеНастройки.ЗавершениеПериодаНачисленияПоОрганизации";
	//	ПараметрыМетода 			= Новый Структура("Организация", Организация);
	//	слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
	//	Возврат слжОбщегоНазначенияМодуль.Логгер().ПолучитьРезультат(ИмяМетода, Результат, ПараметрыМетода); 		
	//КонецЕсли;
	
	ПараметрыСхемы  				= Новый Структура;	
	ПараметрыВТ						= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
	Схема 							= Неопределено;	
	ТекущиеДатыОтчетногоПериодаОбщиеНастройки(Схема, ПараметрыСхемы, "");
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация", 	Организация);
	ПараметрыЗапроса.Вставить("Район", 			Район);
		
	Результат 						= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
	
	Если Результат.Пустой() Тогда
		Результат 					= '0001-01-01';
	Иначе
		Выборка 					= Результат.Выбрать();
		Выборка.Следующий();		
		Результат 					= Выборка.Завершение;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргДатыОтчетногоПериодыОбщиеНастройки.ЗавершениеПериодаНачисленияПоОрганизации";
		ПараметрыМетода 			= Новый Структура("Организация, Район", Организация, Район);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода); 		
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции

Процедура ТекущиеДатыОтчетногоПериодаОбщиеНастройки(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "ТекущиеДатыОтчетногоПериодаОбщиеНастройки") Экспорт  
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];		
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;			
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТекущиеДатыОтчетногоПериодаОбщиеНастройки());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
				
	ВспомогательныеПоля 				= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация,Район";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,"ДатыОтчетногоПериодыОбщиеНастройки", ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти
	
#Область ТекстыЗапросов

Функция ТекстЗапросаТекущиеДатыОтчетногоПериодаОбщиеНастройки()
	
	Текст =
	"ВЫБРАТЬ
	|	ДатыОтчетногоПериодыОбщиеНастройки.Организация КАК Организация,
	|	ДатыОтчетногоПериодыОбщиеНастройки.Район КАК Район,
	|	ДатыОтчетногоПериодыОбщиеНастройки.Завершение КАК Завершение
	|ИЗ
	|	РегистрСведений.энргДатыОтчетногоПериодыОбщиеНастройки КАК ДатыОтчетногоПериодыОбщиеНастройки";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
